config.org
#+title: Emacs Configuration
#+filetags: emacs

* Globals
** Vars :vars:
*** doom id
#+begin_src emacs-lisp
(setq user-full-name "Samuel Culpepper"
      user-mail-address "samuel@samuelculpepper.com")
#+end_src

#+RESULTS:
: samuel@samuelculpepper.com
*** hostname specific
#+begin_src emacs-lisp
(cond
  ((string-equal system-name "qzdl") (setq qz/font-default 32))
  (t (setq qz/font-default 16)))
#+end_src
*** epg propgram
#+begin_src emacs-lisp
(setq epg-gpg-program "gpg")
#+end_src

#+RESULTS:
: gpg

#+RESULTS:
: 16
*** authinfo
#+begin_src emacs-lisp
(load-file "~/.doom.d/private/authinfo.el")

#+end_src

#+RESULTS:
: /home/qzdl/dotfiles/emacs/.doom.d/private/

** Global Bindings :kbd:
These Key Binds Are focused around ergonomics more than mnemonics
*** Mouse jumping
#ERGO
<link-to-elisp-doc 'better-jumper-jump-backwards>
#+begin_src emacs-lisp
  (map! "<mouse-8>" 'better-jumper-jump-backward)
  (map! "<mouse-9>" 'better-jumper-jump-forward)
#+end_src

#+RESULTS:
*** unset {C-z} to eqiv of vim's {O} -> also stop EXWM from hanging
this bind is a DOOM emacs function, lilke )
#+begin_src emacs-lisp
(map! "C-z" #'+default/newline-above)
#+end_src

#+RESULTS:

*** redo {C-?}
#+begin_src emacs-lisp
(map! "C-?" #'undo-redo)
#+end_src

#+RESULTS:

*** Switch macro {C-x C-k} and kill-buffer {C-x k}
#+begin_src emacs-lisp
(map! "C-x C-k" #'kill-this-buffer)
(map! "C-x k" #'kmacro-keymap)
#+end_src

#+RESULTS:

*** HJKL Window control
#+begin_src emacs-lisp
(map! "s-h" #'windmove-left)
(map! "s-j" #'windmove-down)
(map! "s-k" #'windmove-up)
(map! "s-l" #'windmove-right)
#+end_src

#+RESULTS:
*** Switch delete-blank-lines {C-x C-o} and other-window {C-x o}
#+begin_src emacs-lisp
(map! "C-x C-o" #'ace-window)
(map! "C-x o" #'delete-blank-lines)
#+end_src

#+RESULTS:

*** Buffer control
#+begin_src emacs-lisp
(map! "s-n" #'next-buffer)
(map! "s-p" #'previous-buffer)
#+end_src

#+RESULTS:

*** Switch {C-x} and {C-u}
A tip associated with Dvorak, that is equally charming without the dvorak
keyboard layout. This stellar advice came from [[https://www.emacswiki.org/emacs/DvorakKeyboard][EmacsWiki: Dvorak Keyboard]].
#+begin_src emacs-lisp
(define-key key-translation-map [?\C-x] [?\C-u])
(define-key key-translation-map [?\C-u] [?\C-x])
#+end_src

#+RESULTS:
: [24]

*** Shell pop
#+begin_src emacs-lisp
(map! "C-x C-'" #'+eshell/toggle)
#+end_src

#+RESULTS:

**** TODO Abstract this to a ~user-shell/toggle~ function
incase the shell needs to be changed
*** ROT13 buffer
#+begin_src emacs-lisp
(map! "s-B" 'toggle-rot13-mode)
#+end_src

#+RESULTS:
*** roam insert on {s-i}
can just be easier this way
#+begin_src emacs-lisp
(map! "s-i" #'qz/roam-insert)
#+end_src

#+RESULTS:

*** TODO bookmarks
** Functions :func:
*** UTC Timestamp
#+begin_src emacs-lisp
(defun qz/utc-timestamp ()
  (format-time-string "%Y%m%dT%H%M%SZ" (current-time) t))
#+end_src

#+RESULTS:
: qz/utc-timestamp

*** custom popup qz/buffer-popup
#+begin_src emacs-lisp
(defvar qz/buffer-popup-minor-mode-map
  (let ((kmap (make-sparse-keymap)))
    (set-keymap-parent kmap text-mode-map)
    (define-key kmap (kbd "C-c C-c") #'qz/buffer-popup-commit)
    (define-key kmap (kbd "C-c C-k") #'qz/buffer-popup-abort)
    kmap))

(defcustom qz/buffer-popup-window-config
  '(+popup-display-buffer-stacked-side-window-fn)
  ;;  '((display-buffer-reuse-window display-buffer-split-below-and-attach)    (inhibit-same-window . t) (window-height . 0.25))
  "adjust the behaiour of the popup window

totally stolen from <link-to-elisp-doc 'pdf-annot-edit-contents-display-buffer-action>'")

(define-minor-mode qz/buffer-popup-minor-mode
  "Active when editing the contents of qz/buffer-popup."
  nil nil nil
  (when qz/buffer-popup-minor-mode
    (message "%s"
             (substitute-command-keys
              "Press \\[qz/buffer-popup-commit] to commit your changes, \\[qz/buffer-popup-abort] to abandon them."))))

(put 'qz/buffer-popup-minor-mode 'permanent-local t)



;; FIXME make this better for general shit
(defun qz/buffer-popup-finalize (save? &optional kill backfill)
  (setq qz/buffer-popup-last-value
        (cond
         ((and kill backfill) backfill)
         (t (with-current-buffer qz/buffer-popup-current-or-last
              (buffer-substring-no-properties (point-min) (point-max))))))
  (dolist (win (get-buffer-window-list))
    (quit-window t win))
  (if qz/buffer-popup-final
      (funcall qz/buffer-popup-final))
  (message "%s" qz/buffer-popup-last-value))

(defun qz/buffer-popup-commit ()
  (interactive)
  (qz/buffer-popup-finalize t))

(defun qz/buffer-popup-abort ()
  (interactive)
  (qz/buffer-popup-finalize nil t))


(defun qz/buffer-popup-create ()
  (interactive)
  (select-window
   (display-buffer
    (with-current-buffer (get-buffer-create
                          (format "*Edit stuff %s*"
                                  (buffer-name)))
      (qz/buffer-popup-minor-mode 1)
      (org-mode)
      (setq qz/buffer-popup-current-or-last (current-buffer)))
    qz/buffer-popup-window-config))
  qz/buffer-popup-current-or-last)
#+end_src

#+RESULTS:
: qz/buffer-popup-create

*** TODO insert var
stealing from 'describe-variable -> cool to insert the value of named var, from completing read
#+begin_src emacs-lisp
(defun qz/insert-var ()
  (interactive)
  (completing-read
   (format-prompt "Describe variable" (and (symbolp (variable-at-point) (variable-at-point)))
                  #'help--symbol-completion-table
                  (lambda (vv)
                    ;; In case the variable only exists in the buffer
                    ;; the command we switch back to that buffer before
                    ;; we examine the variable.
                    (with-current-buffer orig-buffer
                      (or (get vv 'variable-documentation)
                          (and (boundp vv) (not (keywordp vv))))))
                  t nil nil
                  (if (symbolp v) (symbol-name v)))))
#+end_src

*** contract file name
keep it relative; sorry Ayn
#+begin_src emacs-lisp
(defun qz/contract-file-name (file)
  "turn an objective path to a relative path to homedir `~/`"
  (replace-regexp-in-string(expand-file-name "~/") "~/" file))
#+end_src

#+RESULTS:
: qz/contract-file-name


*** toggle between non-nil -> [ 0 | 1 ], [ on | off ]
This function is used for quality of life in ensuring correct bottom values are
used when toggling modes; the set of activation values are not necessarily using
~[t | nil]~, but can be =[(t n>0) | n<=0]=, which can throw a spanner in the
works for a regular style ~(mode (setq toggle (not toggle)))~ type of
arrangement, given ~[t | nil]~.

An example of this can be found in [[Time in the modeline]], or [[Toggle
ERROR_ROLLBACK]]. Equal is used here to coerce non-numeric arguments into
something that will toggle.
#+begin_src emacs-lisp
(defun qz/toggle-1->0 (n)
  (if (equal 1 n) 0 1))

(defun qz/toggle-on->off (n)
  (if (equal 1 n) "on" "off"))
#+end_src

#+RESULTS:
: qz/toggle-on->off

*** pprint with ~cl-prettyprint~
[[https://stackoverflow.com/questions/3552106/pprint-in-emacs-lisp][elisp - PPRINT in Emacs Lisp? - Stack Overflow]]

#+begin_src emacs-lisp
(defun qz/pprint (form &optional output-stream)
  (princ (with-temp-buffer
           (cl-prettyprint form)
           (buffer-string))
         output-stream))
#+end_src

#+RESULTS:
: qz/pprint

*** fix [[file:../../../life/roam/20201019T125728Z-bluetooth_headphones.org][bluetooth headphones]]
#+begin_src emacs-lisp
(defun qz/bt-a2dp ()
  (interactive)
  (shell-command "pactl set-card-profile bluez_card.2C_41_A1_87_20_BA a2dp_sink"))

(defun qz/bt-headphone-off ()
  (interactive)
  (async-shell-command "bluetoothctl disconnect 2C:41:A1:87:20:BA"))

(defun qz/bt-headphone-on ()
  (interactive)
  (async-shell-command "bluetoothctl connect 2C:41:A1:87:20:BA"))
#+end_src

#+RESULTS:
: qz/bt-headphone-on
