config.org
** wallpaper :init:
<link-to-elisp-doc 'wallpaper-cycle-interval> is measured in seconds, 900 being 15 minutes
#+begin_src emacs-lisp
(setq wallpaper-cycle-interval 900)

(use-package! wallpaper
  :hook ((exwm-randr-screen-change . wallpaper-set-wallpaper)
         (after-init . wallpaper-cycle-mode))
  :custom ((wallpaper-cycle-interval 900)
           (wallpaper-cycle-single t)
           (wallpaper-scaling 'fill)
           (wallpaper-cycle-directory "~/.config/wallpapers")))
#+end_src

#+RESULTS:
| org-roam-mode | wallpaper-cycle-mode | (closure (t) (&rest _) (progn (eval-after-load 'sly #'(lambda nil (sly-setup))))) | doom-modeline-mode | doom-init-fonts-h | doom-init-theme-h | doom-init-leader-keys-h | x-wm-set-size-hint | tramp-register-archive-file-name-handler | magit-maybe-define-global-key-bindings | magit-auto-revert-mode--init-kludge | magit-startup-asserts | magit-version | table--make-cell-map |

** TODO startup programs :init:
#+begin_src emacs-lisp
(setq qz/startup-programs
      '("compton"
        "unclutter"))

(defun qz/run-programs-n-process (p)
  (mapcar (lambda (c) (start-process-shell-command c nil c)) p))

(defun qz/seq-to-kill (p)
  (mapcar (lambda (s) (concat "killall " s)) p))

(defun qz/run-startup-programs ()
  (interactive)
  (qz/run-programs-n-process
   (qz/seq-to-kill qz/startup-programs))
  (qz/run-programs-n-process qz/startup-programs))

(qz/run-startup-programs)
#+end_src

#+RESULTS:
| compton | unclutter |

** global bindings :kbd:
#+begin_src emacs-lisp
(require 'exwm-input)

(defmacro qz/exwm-bind-keys (&rest bindings)
  "Bind input keys in EXWM.
INDINGS is a list of cons cells containing a key (string) and a command."
  `(progn
     ,@(cl-loop for (key . cmd) in bindings
                collect `(exwm-input-set-key
                          ,(cond ((stringp key) (kbd key))
                                 (t key))
                          (quote ,cmd)))))

(require 'window-go)
(qz/exwm-bind-keys
 ("s-r" . exwm-reset)                     ;; `s-r': Reset (to line-mode).
 ("s-w" . exwm-workspace-switch)          ;; `s-w': Switch workspace.
 ("s-&" . qz/read-process-shell-command)  ;; `s-&': Launch program
 ("s-h" . windmove-left)
 ("s-j" . windmove-down)
 ("s-k" . windmove-up)
 ("s-l" . windmove-right)
 ("s-n" . switch-to-next-buffer)
 ("s-p" . switch-to-prev-buffer)
 ("s-0" . delete-window)
 ("s-+" . delete-other-windows)
 ("s-b" . qz/exwm-goto-browser)
 ("s-a" . qz/org-agenda-gtd))
#+end_src

#+RESULTS:

** simulation keys :kbd:
#+begin_src emacs-lisp
(defvar qz/default-simulation-keys
  '(;; movement
    ([?\C-b] . left)
    ([?\M-b] . C-left)
    ([?\C-f] . right)
    ([?\M-f] . C-right)
    ([?\C-p] . up)
    ([?\C-n] . down)
    ([?\C-a] . home)
    ([?\C-e] . end)
    ([?\M-v] . prior)
    ([?\C-v] . next)
    ([?\C-d] . delete)
    ([?\C-k] . (S-end delete))
    ([?\M-d] . (C-S-right delete))
    ;; cut/paste.
    ([?\C-w] . ?\C-x)
    ([?\M-w] . ?\C-c)
    ([?\C-y] . ?\C-v)
    ;; search
    ([?\C-s] . ?\C-f)))

(with-eval-after-load 'exwm-input
  (exwm-input-set-simulation-keys qz/default-simulation-keys))
#+end_src

#+RESULTS:

+RESULTS:
** minibuffer :vars:
#+begin_src emacs-lisp
;(setq exwm-workspace-minibuffer-position 'top)
#+end_src

#+RESULTS:

** remove menu & dialog :vars:
#+begin_src emacs-lisp
(menu-bar-mode -1)
(setq mouse-autoselect-window t
      use-dialog-box nil)
#+end_src

#+RESULTS:
** workspaces & Classes :vars:
#+begin_src emacs-lisp
;; Set the initial workspace number.
(unless (get 'exwm-workspace-number 'saved-value)
  (setq exwm-workspace-number 4))

;; Make class name the buffer name
(add-hook 'exwm-update-class-hook
          (lambda () (exwm-workspace-rename-buffer exwm-class-name)))
#+end_src

#+RESULTS:
| lambda | nil | (exwm-workspace-rename-buffer exwm-class-name) |

** window dividers :vars:
#+begin_src emacs-lisp
(setq window-divider-default-right-width 4)
(setq window-divider-default-bottom-width 4)
(window-divider-mode 1)
#+end_src

#+RESULTS:
: t

** mark windows as real :func:
Emacs can recognise x-windows as 'real' per <link-to-elisp-doc 'doom-real-buffer-p>

#+begin_src emacs-lisp
(add-hook 'exwm-mode-hook #'doom-mark-buffer-as-real-h)
(add-hook 'doom-switch-window-hook #'doom-mark-buffer-as-real-h)

(defun qz/mark-this-buffer-as-real ()
  (interactive)
  (doom-mark-buffer-as-real-h))
#+end_src

#+RESULTS:
: qz/mark-this-buffer-as-real

** shell command readline :func:
#+begin_src emacs-lisp
(defun qz/read-process-shell-command (command)
  "Used to launch a program by creating a process. Invokes
start-process-shell-command' with COMMAND"
  (interactive (list (read-shell-command "λ ")))
  (start-process-shell-command command nil command))
#+end_src

#+RESULTS:
: qz/read-process-shell-command

** title as buffer naming hook :func:
suspicious; acts as soon as eval'd
#+begin_src emacs-lisp
(add-hook 'exwm-update-title-hook
          (lambda () (exwm-workspace-rename-buffer exwm-title)))
#+end_src

#+RESULTS:
| lambda | nil | (exwm-workspace-rename-buffer exwm-title) |

** TODO screenshotting with selection / window from dmenu script :func:
** automatically float windows :func:
#+begin_src emacs-lisp
(defcustom qz/exwm-floating-window-classes '("keybase")
  "List of instance names of windows that should start in the floating mode.")

(defun qz/exwm-float-window-on-specific-windows ()
  (when (member exwm-instance-name qz/exwm-floating-window-classes)
    (exwm-floating-toggle-floating)))
(add-hook 'exwm-manage-finish-hook #'qz/exwm-float-window-on-specific-windows)
#+end_src

#+RESULTS:
| qz/exwm-float-window-on-specific-windows |

** goto :func:
#+begin_src emacs-lisp
(defun exwm-goto--switch-to-buffer (buf)
  (if-let ((w (get-buffer-window buf t)))
      (select-window w)
    (exwm-workspace-switch-to-buffer buf)))

(cl-defun exwm-goto (command &key class)
  (if-let ((bs (cl-remove-if-not (lambda (buf)
                                   (with-current-buffer buf
                                     (and (eq major-mode 'exwm-mode)
                                          (cond
                                           ((stringp class)
                                            (string-equal class exwm-class-name))))))
                                 (buffer-list))))
      (exwm-goto--switch-to-buffer (car bs))
    (start-process-shell-command class nil command)))
#+end_src

#+RESULTS:
: exwm-goto

** goto apps :func:
#+begin_src emacs-lisp
(defun qz/exwm-goto-browser ()
  (interactive)
  (exwm-goto "firefox" :class "Firefox"))
#+end_src

#+RESULTS:
: qz/exwm-goto-browser

* Emacs Server :init:
#+begin_src emacs-lisp
(server-start)
#+end_src

#+RESULTS:

* TODO Hydra
** n :kbd:
The =n= of {C-c n} denotes notes.

#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("n" . "notes")
       (:prefix-map ("d" . "by date")
          :desc "Arbitrary date" "d" #'org-roam-dailies-date
          :desc "Today"          "t" #'org-roam-dailies-today
          :desc "Tomorrow"       "m" #'org-roam-dailies-tomorrow
          :desc "Yesterday"      "y" #'org-roam-dailies-yesterday)
       "f" #'org-roam-find-file
       "F" #'find-file-in-notes))
#+end_src

#+RESULTS:
: find-file-in-notes

* [[file:../../../life/roam/20200412130848-programming.org][Programming]]
** [[file:../../../life/roam/20200623T110142Z-sql.org][SQL]]
For reference: [[https://www.emacswiki.org/emacs/SqlMode][EmacsWiki: Sql Mode]]
*** Toggle ERROR_ROLLBACK :psql:func:
#+begin_src emacs-lisp
(setq qz/psql-error-rollback 0)

(qz/toggle-1->0 qz/psql-error-rollback)

(defun qz/psql-toggle-error-rollback ()
  (interactive)
  (setq qz/psql-error-rollback
        (qz/toggle-1->0 qz/psql-error-rollback))
  (sql-send-string
   (concat "\\set ON_ERROR_ROLLBACK "
           (qz/toggle-on->off qz/psql-error-rollback)))
  (sql-send-string
   "\\echo ON_ERROR_ROLLBACK is :ON_ERROR_ROLLBACK"))
#+end_src

#+RESULTS:
: qz/psql-toggle-error-rollback

*** Upcase SQL Keywords :func:
Lifted from [[https://www.emacswiki.org/emacs/SqlMode#toc4][EmacsWiki: Sql Mode]] (#toc4)
#+begin_src emacs-lisp
  (defun qz/upcase-sql-keywords ()
    (interactive)
    (save-excursion
      (dolist (keywords sql-mode-postgres-font-lock-keywords)
        (goto-char (point-min))
        (while (re-search-forward (car keywords) nil t)
          (goto-char (+ 1 (match-beginning 0)))
          (when (eql font-lock-keyword-face (face-at-point))
            (backward-char)
            (upcase-word 1)
            (forward-char))))))
#+end_src

#+RESULTS:
: qz/upcase-sql-keywords

** paredit
*** paredit-forward/backward-slurp {M-n/p} :kbd:
#+begin_src emacs-lisp
(map! :mode paredit-mode
      "M-p" #'paredit-forward-slurp-sexp
      "M-n" #'paredit-backward-slurp-sexp)
#+end_src

#+RESULTS:

** [[file:../../../life/roam/20200402172258-common_lisp.org][Common Lisp]]
*** cl-font-lock-built-in-mode :vars:
"Highlight built-in functions, variables, and types in ‘lisp-mode’."
- Enable feature from 28.1 if exists
  <link-to-elisp-doc 'cl-font-lock-built-in-mode>
#+begin_src emacs-lisp
(if (symbolp 'cl-font-lock-built-in-mode)
    (cl-font-lock-built-in-mode 1))
#+end_src

#+RESULTS:
: t

*** sly eval-overlay :func:

Using the handy [[https://github.com/xiongtx/eros][eros]], advice from [[https://www.reddit.com/r/emacs/comments/bi4xk1/evaluation_overlays_in_slime_for_common_lisp/][Evaluation overlays in slime for common lisp : emacs]]
#+begin_src emacs-lisp :tangle no
(autoload 'cider--make-result-overlay "cider-overlays")

(defun endless/eval-overlay (value point)
  (cider--make-result-overlay (format "%S" value)
                              :where point
                              :duration 'command)
  ;; Preserve the return value.
  value)


;; (define-key! 'sly-mode-map "C-x C-e" 'sly-eval-last-expression)
#+end_src

#+RESULTS:
: endless/eval-overlay

** [[file:../../../life/roam/20200415T145703Z-emacs_lisp.org][Emacs Lisp]]
