config.org
*** Initialisation :init:vars:

#+begin_src emacs-lisp
(require 'org-recoll)

(setq org-recoll-command-invocation "recollq -t -A"
      org-recoll-results-num 100)
#+end_src

#+RESULTS:
: 100

*** Bindings :kbd:
#+begin_src emacs-lisp
(map! "C-c g" #'org-recoll-search)
(map! "C-c u" #'org-recoll-update-index)
(map! :mode org-recoll-mode "q" #'kill-this-buffer)
#+end_src

#+RESULTS:

** org-protocol :init:
#+begin_src emacs-lisp
(require 'org-protocol)
#+end_src

#+RESULTS:
: org-protocol

** org-capture
*** TODO templates :init:vars:
#+begin_src emacs-lisp
(require 'org-capture)

(setq qz/capture-title-timestamp "%(qz/utc-timestamp)-${slug}")

(setq org-capture-templates
      `(("i" "inbox" entry
         (file ,(concat qz/org-agenda-directory "inbox.org"))
         "* TODO %? \nCREATED: %u\nFROM: %a")
        ;; capture link to live `org-roam' thing
        ("I" "current-roam" entry (file ,(concat qz/org-agenda-directory "inbox.org"))
         (function qz/current-roam-link)
         :immediate-finish t)
        ("n" "now, as in NOW" entry (file ,(concat qz/org-agenda-directory "wip.org"))
         "* TODO [#A1] %? \nDEADLINE: %T\nCREATED: %u")
        ;; fire directly into inbox
        ("c" "org-protocol-capture" entry (file ,(concat qz/org-agenda-directory "inbox.org"))
         "* TODO [[%:link][%:description]]\n\n %i"
         :immediate-finish t)
        ;; spanish language capturing
        ("v" "vocab; spanish" entry
         (file+headline ,(concat qz/notes-directory "spanish_language.org") "vocab, phrases")
         "** \"%?\" :es:\nFROM: %a\n\n*** :en:\n")
        ("w" "Weekly Review" entry
         (file+olp+datetree ,(concat qz/org-agenda-directory "reviews.org"))
         (file ,(concat qz/org-agenda-directory "templates/weekly_review.org")))
        ("r" "Reading" todo ""
         ((org-agenda-files '(,(concat qz/org-agenda-directory "reading.org")))))))
#+end_src

#+RESULTS:
| i | inbox | entry | (file ~/life/roam/inbox.org) | * TODO %? |
*** FIXME doom half-loaded buffer hack
https://github.com/hlissner/doom-emacs/issues/4832

#+begin_src emacs-lisp
(advice-add
 #'org-capture :around
 (lambda (fun &rest args)
   (letf! ((#'+org--restart-mode-h #'ignore))
     (apply fun args))))
#+end_src

#+RESULTS:
*** TODO weekly review
*** Convenience Functions :func:
#+begin_src emacs-lisp
;; helper capture function for `org-roam' for `agenda-mode'
(defun qz/org-inbox-capture ()
  (interactive)
  "Capture a task in agenda mode."
  (org-capture nil "i"))

(defun qz/org-roam-capture-current ()
  (interactive)
  "Capture a task in agenda mode."
  (org-capture nil "I"))

(defun qz/org-roam-capture-todo ()
  (interactive)
  "Capture a task in agenda mode."
  (org-roam-capture nil "_"))
#+end_src

#+RESULTS:
: qz/org-roam-capture-todo
**** current roam link
#+begin_src emacs-lisp
(defun qz/current-roam-link ()
  (interactive)
  "Get link to org-roam file with title"
  (concat "* TODO [[" (qz/contract-file-name (buffer-file-name (buffer-base-buffer))) "]["
          (car (org-roam--extract-titles)) "]]"))
#+end_src
** org-gcal
*** secret properties :vars:
set in authinfo.el

*** files :vars:
#+begin_src emacs-lisp
(setq org-gcal-fetch-file-alist
      `((,qz/calendar-home . ,(concat qz/notes-directory "calendar-home.org"))
        (,qz/calendar-work . ,(concat qz/notes-directory "calendar-work.org"))
        (,qz/calendar-shared . ,(concat qz/notes-directory "calendar-shared.org"))))
(qz/pprint org-gcal-fetch-file-alist)
#+end_src

#+RESULTS:
:
: (("imzaniiyt@gmail.com" . "~/life/roam/calendar-home.org")
:  ("ejf1ja19lprl01dbued3b67ctc@group.calendar.google.com" . "~/life/roam/calendar-work.org")
:  ("3dlc1cbk5nidjfrvrvkap0cndo@group.calendar.google.com" . "~/life/roam/calendar-shared.org"))

*** recurring events headlines
#+begin_src emacs-lisp
(setq org-gcal-recurring-events-mode 'nested)
#+end_src

#+RESULTS:
: nested

** [[file:../../../life/roam/20200401202402-org_roam.org][org-roam]]
*** Initialisation :init:vars:
#+begin_src emacs-lisp
(use-package! org-roam
  :commands (org-roam-insert org-roam-find-file org-roam-switch-to-buffer org-roam)
  :hook
  (after-init . org-roam-mode)
  :custom-face
  (org-roam-link ((t (:inherit org-link :foreground "#df85ff"))))
  :init
  (map! :leader
        :prefix "n"
        :desc "org-roam" "l" #'org-roam
        :desc "org-roam-switch-to-buffer" "b" #'org-roam-switch-to-buffer
        :desc "org-roam-find-file" "f" #'org-roam-find-file
        :desc "org-roam-insert" "i" #'qz/roam-insert
        :desc "org-agenda-todo" "t" #'qz/org-agenda-todo
        :desc "org-roam-dailies-today" "J" #'org-roam-dailies-today
        :desc "org-roam-dailies-capture-today" "j" #'org-roam-dailies-capture-today
        :desc "qz/org-roam-capture-current" "C" #'qz/org-roam-capture-current
        :desc "qz/org-roam-capture-current" "C-c" #'qz/org-roam-capture-current
        :desc "qz/org-gcal--current" "C-c" #'qz/org-roam-capture-current
        :desc "org-roam-capture" "c" #'org-roam-capture)
  (setq org-roam-directory qz/notes-directory
        org-roam-dailies-directory qz/notes-directory
        org-roam-db-location (concat org-roam-directory "org-roam.db")
        org-roam-db-update-idle-seconds 0
        org-roam-graph-executable "dot"
        org-roam-graph-extra-config '(("overlap" . "false"))
        org-roam-graph-exclude-matcher nil)

  :config
  (require 'org-roam-protocol))

(org-roam-mode +1)
#+end_src

#+RESULTS:
: t

*** capture templates, roam :vars:
#+begin_src emacs-lisp
(setq qz/org-roam-capture-head
      "#+setupfile:./hugo_setup.org
,#+hugo_section: zettels
,#+hugo_slug: ${slug}
,#+title: ${title}\n")

(setq org-roam-capture-templates
      `(("d" "default" plain (function org-roam--capture-get-point)
         "%?"
         :file-name ,qz/capture-title-timestamp
         :head ,qz/org-roam-capture-head
         :unnarrowed t)
        ("_" "pass-though-todo" plain (function org-roam--capture-get-point)
         "%?"
         :file-name ,qz/capture-title-timestamp
         :head ,qz/org-roam-capture-head
         :immediate-finish t)
        ("p" "private" plain (function org-roam-capture--get-point)
         "%?"
         :file-name ,(concat "private-" qz/capture-title-timestamp)
         :head ,qz/org-roam-capture-head
         :unnarrowed t)))
#+end_src

#+RESULTS:
| d | default | plain | #'org-roam--capture-get-point | %? | :file-name | %(qz/utc-timestamp)-${slug} | :head | #+setupfile:./hugo_setup.org |

*** capture templates, protocol :vars:
#+begin_src emacs-lisp
(setq org-roam-capture-ref-templates
      `(("r" " ref" plain (function org-roam-capture--get-point)
         "%?"
         :file-name ,qz/capture-title-timestamp
         :head "#+setupfile:./hugo_setup.org
#+roam_key: ${ref}
#+hugo_slug: ${slug}
#+title: ${title}
#+source: ${ref}"
         :unnarrowed t)))
#+end_src

#+RESULTS:
| r | ref | plain | #'org-roam-capture--get-point | %? | :file-name | %(qz/utc-timestamp)-${slug} | :head | #+setupfile:./hugo_setup.org |

*** capture templates, dailies :vars:
#+begin_src emacs-lisp
(setq org-roam-dailies-capture-templates
      `(("d" "default" entry (function org-roam-capture--get-point)
         "* %<%H:%m> %?\nCREATED: %u"
         :file-name  "private-%<%Y-%m-%d>"
         :head "#+title: <%<%Y-%m-%d>>\n#+roam_tags: daily private\n\n")))
#+end_src

#+RESULTS:
| d | default | entry | #'org-roam-capture--get-point | * %<%H:%m> %? |

*** migrate properties :func:
#+begin_src emacs-lisp
(defun qz/org-roam-migrate-jobs ()
  (interactive )
  (dolist (file (org-roam--list-all-files))
                                        ;(message "processing %s" file)
    (with-current-buffer (or (find-buffer-visiting file)
                             (find-file-noselect file))
      ;; TODO = project
      (vulpea-project-update-tag)

      (save-buffer))))
#+end_src

#+RESULTS:
: qz/org-roam-migrate-jobs
