config.el

(require 'org-recoll)

(setq org-recoll-command-invocation "recollq -t -A"
      org-recoll-results-num 100)

(map! "C-c g" #'org-recoll-search)
(map! "C-c u" #'org-recoll-update-index)
(map! :mode org-recoll-mode "q" #'kill-this-buffer)

(require 'org-protocol)

(require 'org-capture)

(setq qz/capture-title-timestamp "%(qz/utc-timestamp)-${slug}")

(setq org-capture-templates
      `(("i" "inbox" entry
         (file ,(concat qz/org-agenda-directory "inbox.org"))
         "* TODO %? \nCREATED: %u\nFROM: %a")
        ;; capture link to live `org-roam' thing
        ("I" "current-roam" entry (file ,(concat qz/org-agenda-directory "inbox.org"))
         (function qz/current-roam-link)
         :immediate-finish t)
        ("n" "now, as in NOW" entry (file ,(concat qz/org-agenda-directory "wip.org"))
         "* TODO [#A1] %? \nDEADLINE: %T\nCREATED: %u")
        ;; fire directly into inbox
        ("c" "org-protocol-capture" entry (file ,(concat qz/org-agenda-directory "inbox.org"))
         "* TODO [[%:link][%:description]]\n\n %i"
         :immediate-finish t)
        ("w" "Weekly Review" entry
         (file+olp+datetree ,(concat qz/org-agenda-directory "reviews.org"))
         (file ,(concat qz/org-agenda-directory "templates/weekly_review.org")))
        ("r" "Reading" todo ""
         ((org-agenda-files '(,(concat qz/org-agenda-directory "reading.org")))))))

(advice-add
 #'org-capture :around
 (lambda (fun &rest args)
   (letf! ((#'+org--restart-mode-h #'ignore))
     (apply fun args))))

;; helper capture function for `org-roam' for `agenda-mode'
(defun qz/current-roam-link ()
  (interactive)
  "Get link to org-roam file with title"
  (concat "* TODO [[" (buffer-file-name) "]["
          (car (org-roam--extract-titles)) "]]"))

(defun qz/org-inbox-capture ()
  (interactive)
  "Capture a task in agenda mode."
  (org-capture nil "i"))

(defun qz/org-roam-capture-current ()
  (interactive)
  "Capture a task in agenda mode."
  (org-capture nil "I"))

(defun qz/org-roam-capture-todo ()
  (interactive)
  "Capture a task in agenda mode."
  (org-roam-capture nil "_"))

(setq org-gcal-fetch-file-alist
      `((qz/calendar-home . ,(concat qz/notes-directory "calendar-home.org"))
        (qz/calendar-work . ,(concat qz/notes-directory "calendar-work.org"))
        (qz/calendar-shared . ,(concat qz/notes-directory "calendar-shared.org"))))

(setq org-gcal-recurring-events-mode 'nested)

(use-package! org-roam
  :commands (org-roam-insert org-roam-find-file org-roam-switch-to-buffer org-roam)
  :hook
  (after-init . org-roam-mode)
  :custom-face
  (org-roam-link ((t (:inherit org-link :foreground "#df85ff"))))
  :init
  (map! :leader
        :prefix "n"
        :desc "org-roam" "l" #'org-roam
        :desc "org-roam-switch-to-buffer" "b" #'org-roam-switch-to-buffer
        :desc "org-roam-find-file" "f" #'org-roam-find-file
        :desc "org-roam-insert" "i" #'qz/roam-insert
        :desc "org-agenda-todo" "t" #'qz/org-agenda-todo
        :desc "org-roam-dailies-today" "J" #'org-roam-dailies-today
        :desc "org-roam-dailies-capture-today" "j" #'org-roam-dailies-capture-today
        :desc "qz/org-roam-capture-current" "C" #'qz/org-roam-capture-current
        :desc "qz/org-roam-capture-current" "C-c" #'qz/org-roam-capture-current
        :desc "qz/org-gcal--current" "C-c" #'qz/org-roam-capture-current
        :desc "org-roam-capture" "c" #'org-roam-capture)
  (setq org-roam-directory qz/notes-directory
        org-roam-dailies-directory qz/notes-directory
        org-roam-db-location (concat org-roam-directory "org-roam.db")
        org-roam-graph-executable "dot"
        org-roam-graph-extra-config '(("overlap" . "false"))
        org-roam-graph-exclude-matcher nil)

  :config
  (require 'org-roam-protocol))

(org-roam-mode +1)

(setq qz/org-roam-capture-head
      "#+setupfile:./hugo_setup.org
#+hugo_section: zettels
#+hugo_slug: ${slug}
#+title: ${title}\n")

(setq org-roam-capture-templates
      `(("d" "default" plain (function org-roam--capture-get-point)
         "%?"
         :file-name ,qz/capture-title-timestamp
         :head ,qz/org-roam-capture-head
         :unnarrowed t)
        ("_" "pass-though-todo" plain (function org-roam--capture-get-point)
         "%?"
         :file-name ,qz/capture-title-timestamp
         :head ,qz/org-roam-capture-head
         :immediate-finish t)
        ("p" "private" plain (function org-roam-capture--get-point)
         "%?"
         :file-name ,(concat "private-" qz/capture-title-timestamp)
         :head ,qz/org-roam-capture-head
         :unnarrowed t)))

(setq org-roam-capture-ref-templates
      `(("r" " ref" plain (function org-roam-capture--get-point)
         "%?"
         :file-name ,qz/capture-title-timestamp
         :head "#+setupfile:./hugo_setup.org
#+roam_key: ${ref}
#+hugo_slug: ${slug}
#+title: ${title}
#+source: ${ref}"
         :unnarrowed t)))

(setq org-roam-dailies-capture-templates
      `(("d" "default" entry (function org-roam-capture--get-point)
         "* %<%H:%m> %?\nCREATED: %u"
         :file-name  "private-%<%Y-%m-%d>"
         :head "#+title: <%<%Y-%m-%d>>\n#+roam_tags: daily private\n\n")))

(defun qz/org-roam-migrate-jobs ()
  (interactive )
  (dolist (file (org-roam--list-all-files))
                                        ;(message "processing %s" file)
    (with-current-buffer (or (find-buffer-visiting file)
                             (find-file-noselect file))
      ;; TODO = project
      (vulpea-project-update-tag)
      ;; making things private
                                        ;      (when (qz/should-be-private-p file)
                                        ;       (qz/org-roam-make-private))
      (save-buffer))))
