config.org
*** auto populate FILETAG :func:
https://d12frosted.io/posts/2020-06-25-task-management-with-roam-vol3.html

#+begin_src emacs-lisp
(defun vulpea-ensure-filetag ()
  "Add respective file tag if it's missing in the current note."
  (interactive)
  (let ((tags (org-roam--extract-tags-prop
               (buffer-file-name
                (buffer-base-buffer)))))
    (when (and (seq-contains-p tags "person")
               (null (org-roam--extract-global-props-keyword
                      '("filetags"))))
      (let ((tag (qz/title-to-tag (+org-get-global-property "title"))))
        (progn (message tag)
               (qz/org-roam-add-tag tag t))))))

(defun vulpea-tags-add ()
  "Add a tag to current note."
  (interactive)
  (when (org-roam-tag-add)
    (vulpea-ensure-filetag)))

(defun qz/roam-dispatch-person (title)
  "add tag to headline for PERSON"
  (save-excursion
    (ignore-errors
      (org-back-to-heading)
      (org-set-tags
       (seq-uniq
        (cons
         (vulpea--title-to-tag title)
         (org-get-tags nil t)))))))

(setq qz/roam-tag-dispatch
      '(("person" . qz/roam-dispatch-person)))

(defun qz/roam-insert ()
  "Insert a link to the note."
  (interactive)
  (when-let*
      ((res (org-roam-insert))
       (path (plist-get res :path))
       (title (plist-get res :title))
       (roam-tags (org-roam-with-file path nil
                    (org-roam--extract-tags path))))
    (when (seq-contains-p roam-tags "person")
      (qz/roam-dispatch-person title)
      (save-buffer res))))

(defun vulpea-project-p ()
  "Return non-nil if current buffer has any todo entry.

TODO entries marked as done are ignored, meaning the this
function returns nil if current buffer contains only completed
tasks.

(1) parse the buffer using org-element-parse-buffer. It
  returns an abstract syntax tree of the current Org buffer. But
  since we care only about headings, we ask it to return only them
  by passing a GRANULARITY parameter - 'headline. This makes
  things faster.

(2) Then we extract information about TODO keyword from
  headline AST, which contains a property we are interested in -
  :todo-type, which returns the type of TODO keyword according to
  org-todo-keywords - 'done, 'todo or nil (when keyword is not
  present).

(3) Now all we have to do is to check if the buffer list contains
  at least one keyword with 'todo type. We could use seq=find on
  the result of org-element-map, but it turns out that it provides
  an optional first-match argument that can be used for our needs."
  (org-element-map                          ; (2)
      (org-element-parse-buffer 'headline) ; (1)
      'headline
    (lambda (h)
      (eq (org-element-property :todo-type h)
          'todo))
    nil 'first-match))                     ; (3)

(defun vulpea-project-update-tag ()
  "Update PROJECT tag in the current buffer."
  (when (and (not (active-minibuffer-window))
             (vulpea-buffer-p))
    (let* ((file (buffer-file-name (buffer-base-buffer)))
           (all-tags (org-roam--extract-tags file))
           (prop-tags (org-roam--extract-tags-prop file))
           (tags prop-tags))
      (if (vulpea-project-p)
          (setq tags (cons "project" tags))
        (setq tags (remove "project" tags)))
      (if (and (vulpea-buffer-p) (qz/private-p))
          (setq tags (cons "private" tags))
        (setq tags (remove "private" tags)))
      (unless (eq prop-tags tags)
        (org-roam--set-global-prop
         "ROAM_TAGS"
         (combine-and-quote-strings (seq-uniq tags)))))))

(defun vulpea-buffer-p ()
  "Return non-nil if the currently visited buffer is a note."
  (interactive)
  (and buffer-file-name
       (string-prefix-p
        (expand-file-name (file-name-as-directory org-roam-directory))
        (file-name-directory buffer-file-name))))

(defun vulpea-project-files ()
  "Return a list of note files containing Project tag."
  (seq-map
   #'car
   (org-roam-db-query
    [:select file
     :from tags
     :where (like tags (quote "%\"project\"%"))])))

(defun vulpea-agenda-files-update (&rest _)
  "Update the value of `org-agenda-files'."
  (setq org-agenda-files
        (seq-uniq
         (append qz/org-agenda-files (vulpea-project-files)))))



(advice-add 'org-agenda :before #'vulpea-agenda-files-update)
#+end_src

#+RESULTS:
*** testing
#+begin_src emacs-lisp
(qz/pprint    (append qz/org-agenda-files (vulpea-project-files)))
#+end_src

#+RESULTS:
#+begin_example

("/home/qzdl/life/roam/calendar-home.org" "/home/qzdl/life/roam/calendar-work.org"
 "/home/qzdl/life/roam/schedule.org"
 "/home/qzdl/life/roam/20210505T162454Z-interactive_network_visualization_with_r_r_bloggers.org"
 "/home/qzdl/life/roam/private-2020-12-09.org"
 "/home/qzdl/life/roam/20200701T153403Z-common_lisp_the_language.org"
 "/home/qzdl/life/roam/20200619T215855Z-common_lisp_repl_diaries.org"
 "/home/qzdl/life/roam/20200605T122503Z-meeting_innovation_et_al_0.org"
 "/home/qzdl/life/roam/20210518T124941Z-building_living.org"
 "/home/qzdl/life/roam/20200701T103013Z-counsel_spotify.org"
 "/home/qzdl/life/roam/20200606T175037Z-marvel_movie_timeline_the_best_order_to_watch_marvel_movies.org"
 "/home/qzdl/life/roam/20200405160940-meditation_apps_are_fueling_tech_addiction_not_easing_stress.org"
 "/home/qzdl/life/roam/20210311T122210Z-tennet_hierarchical_lists.org"
 "/home/qzdl/life/roam/20200403151517-a_beginner_s_guide_to_graph_visualization.org"
 "/home/qzdl/life/roam/next.org"
 "/home/qzdl/life/roam/20210427T143800Z-disturbing_films.org"
 "/home/qzdl/life/roam/20201117T102439Z-augmenting_human_intellect_a_conceptual_framework.org"
 "/home/qzdl/life/roam/20200515T113542Z-igraph.org"
 "/home/qzdl/life/roam/20200611T112619Z-autovacuum.org"
 "/home/qzdl/life/roam/20200515T152023Z-pl_pgsql.org"
 "/home/qzdl/life/roam/private-2020-08-30.org"
 "/home/qzdl/life/roam/20210404T152634Z-learning_mathematics.org"
 "/home/qzdl/life/roam/20201117T102439Z-augmenting_human_intellect.org"
 "/home/qzdl/life/roam/20200611T115532Z-pg_stat_database.org"
 "/home/qzdl/life/roam/20200623T081435Z-pg_deploy.org"
 "/home/qzdl/life/roam/20210422T104455Z-org_roam_database_machinations.org"
 "/home/qzdl/life/roam/private-2020-10-20.org"
 "/home/qzdl/life/roam/20201031T163512Z-jessealdridge_electric_toothbrush_simple_client_server_notetaking_tool_inspired_by_notational_velocity.org"
 "/home/qzdl/life/roam/20200615T082229Z-moving_to_berlin.org"
 "/home/qzdl/life/roam/watching.org"
 "/home/qzdl/life/roam/jorge_luis_borges.org"
 "/home/qzdl/life/roam/private-2020-06-02.org"
 "/home/qzdl/life/roam/20200511T151311Z-information_and_the_universe.org"
 "/home/qzdl/life/roam/private-2020-12-10.org"
 "/home/qzdl/life/roam/private-2021-04-04.org"
 "/home/qzdl/life/roam/schedule.org"
 "/home/qzdl/life/roam/20200419T194507Z-microgreens.org"
 "/home/qzdl/life/roam/20200903T080046Z-tpcde_728_monitor_filter_performance_thinkproject_jira.org"
 "/home/qzdl/life/roam/wip.org"
 "/home/qzdl/life/roam/20200609T150107Z-how_to_get_a_list_of_video_capture_devices_web_cameras_on_linux_ubuntu_c_c_stack_overflow.org"
 "/home/qzdl/life/roam/private-2021-04-20.org"
 "/home/qzdl/life/roam/private-2021-05-23.org"
 "/home/qzdl/life/roam/learning.org"
 "/home/qzdl/life/roam/20210524T190500Z-static_equilibrium_constraint.org"
 "/home/qzdl/life/roam/20200515T082816Z-org_roam_network_analysis.org"
 "/home/qzdl/life/roam/reading.org"
 "/home/qzdl/life/roam/inbox.org"
 "/home/qzdl/life/roam/20200609T132052Z-projects.org")
#+end_example

*** auto hooks :func:
#+begin_src emacs-lisp
(add-hook 'find-file-hook #'vulpea-project-update-tag)
(add-hook 'before-save-hook #'vulpea-project-update-tag)
(add-hook 'before-save-hook #'vulpea-ensure-filetag)
#+end_src

#+RESULTS:
| vulpea-ensure-filetag | vulpea-project-update-tag |
*** convert title into tag :func:
#+begin_src emacs-lisp
(defun qz/title-to-tag (title)
  "Convert TITLE to tag."
  (if (equal "@" (subseq title 0 1))
      title
    (concat "@" (s-replace " " "" title))))
#+end_src

#+RESULTS:
: qz/title-to-tag

*** determine if a file should-be-private-p :func:
might be better to use the file prop, but maybe we keep the message in to deem

#+begin_src emacs-lisp
(defun qz/private-p ()
  (interactive)

  (let ((title (+org--get-property "title")))
                                        ;(message (concat "...checking privateness of " title))
    (if (not title)
        (message "WARNING: unable to evaluate privateness; file [" file "] has no title")
      (or (string-match-p ".?[0-9]\\{4\\}-[0-9]\\{2\\}-[0-9]\\{2\\}.?" title)
          (string-match-p "meeting" title)
          (qz/org-roam-has-link-to-p title "thinkproject")))))

(defun qz/should-be-private-p (file)
  (with-current-buffer (or (find-buffer-visiting file)
                           (find-file-noselect file))
    (qz/private-p)))

(defun qz/is-file-private ()
  (interactive)
  (message (concat "should " (f-this-file) " be private..? "
                   (or (and (qz/should-be-private-p (f-this-file)) "yes") "no"))))
#+end_src

#+RESULTS:
: qz/is-file-private
*** get list of private notes
#+begin_src emacs-lisp
(defun qz/org-roam-private-files ()
  "Return a list of note files containing tag =private="
  (seq-map
   #'car
   (org-roam-db-query
    [:select file
     :from tags
     :where (like tags (quote "%\"private\"%"))])))

;(qz/pprint (qz/org-roam-private-files))
#+end_src

#+RESULTS:
: qz/org-roam-private-files


