config.org
*** has link to
good for restricting to work stuff

#+begin_src emacs-lisp
(defun qz/has-link-to (src dst)
  (org-roam-db-query
   [:select source
    :from links
    :where (and (= dest $r1)
                (= source $r2))]
   src dest))

(defun qz/has-link (a b)
  (seq-map
   #'car
   (org-roam-db-query
    [:select [source dest]
     :from links
     :where (or (and (= dest a) (= source b))
                (and (= dest b) (= source a)))])))

                                        ;(org-roam-db-query
                                        ; [:select *
                                        ;  :from links
                                        ;  :where (and (= dest $r1)
                                        ;              (= source $r2))]
                                        ; "/home/qzdl/life/roam/20200401201707-thinkproject.org"
                                        ; "/home/qzdl/life/roam/20210311T113202Z-chris_heimann.org")
                                        ;
                                        ;(qz/has-link-to
                                        ; "/home/qzdl/life/roam/20210311T113202Z-chris_heimann.org"
                                        ; "/home/qzdl/life/roam/20200401201707-thinkproject.org"))
#+end_src

#+RESULTS:

*** a
#+begin_src emacs-lisp
(org-roam-db-query
    [:select *
     :from links
     :limit 10])
#+end_src

#+RESULTS:
| /home/qzdl/life/roam/20200402200035-what_is_hierarchy_in_this_sense_of_information_representation.org | /home/qzdl/life/roam/20200402200009-what_are_the_implications_of_thinking_in_hierarchies_with_regard_to_associating_and_understanding.org | file | (:outline nil :point 150)  |
| /home/qzdl/life/roam/20200402200035-what_is_hierarchy_in_this_sense_of_information_representation.org | /home/qzdl/life/roam/20200410185030-focus_question.org                                                                                    | file | (:outline nil :point 78)   |
| /home/qzdl/life/roam/20200403150915-der_zettelkasten_als_zweitgedachtnis_niklas_luhmanns.org          | /home/qzdl/life/roam/20200403151210-johannes_schmidt.org                                                                                  | file | (:outline nil :point 232)  |
| /home/qzdl/life/roam/20200403150915-der_zettelkasten_als_zweitgedachtnis_niklas_luhmanns.org          | /home/qzdl/life/roam/20200403143144-zettlekasten.org                                                                                      | file | (:outline nil :point 166)  |
| /home/qzdl/life/roam/20200403150915-der_zettelkasten_als_zweitgedachtnis_niklas_luhmanns.org          | /home/qzdl/life/roam/20200610T104431Z-german_language.org                                                                                 | file | (:outline nil :point 111)  |
| /home/qzdl/life/roam/the_personal_analytics_of_my_life_stephen_wolfram_writings.org                   | /home/qzdl/life/roam/20200511T151311Z-information_and_the_universe.org                                                                    | file | (:outline nil :point 1320) |
| /home/qzdl/life/roam/the_personal_analytics_of_my_life_stephen_wolfram_writings.org                   | /home/qzdl/life/roam/20200414200342-night_owl.org                                                                                         | file | (:outline nil :point 1194) |
| /home/qzdl/life/roam/the_personal_analytics_of_my_life_stephen_wolfram_writings.org                   | /home/qzdl/life/roam/20200515T160040Z-a_new_kind_of_science.org                                                                           | file | (:outline nil :point 967)  |
| /home/qzdl/life/roam/the_personal_analytics_of_my_life_stephen_wolfram_writings.org                   | /home/qzdl/life/roam/20200414193742-treadmill_desk.org                                                                                    | file | (:outline nil :point 885)  |
| /home/qzdl/life/roam/the_personal_analytics_of_my_life_stephen_wolfram_writings.org                   | /home/qzdl/life/roam/20200515T115551Z-quantified_self.org                                                                                 | file | (:outline nil :point 425)  |

*** make private by tagging "private" :func:
#+begin_src emacs-lisp
(defun qz/org-roam-make-private ()
  (interactive)
  (qz/org-roam-add-tag "private" t))
#+end_src

#+RESULTS:
: qz/org-roam-make-private

*** reset; clear automated roam_tags, filetags

*** TODO check if file has links to given note :func:
[[file:../../../life/roam/20210422T104455Z-org_roam_database_machinations.org][org-roam database machinations]]
#+begin_src emacs-lisp
(defun qz/org-roam-has-link-to-p (source dest)
  "TODO implement; returns t/nil if source links to dest"
  nil)
#+end_src

#+RESULTS:
: qz/org-roam-has-link-to-p

*** add global prop, preserving existing :func:
#+begin_src emacs-lisp
(defun qz/org-roam-add-global-prop (prop val)
  (org-roam--set-global-prop
   prop
   (combine-and-quote-strings
    (seq-uniq
     (cons val (split-string-and-unquote
                (or (+org--get-property prop) "")))))))
#+end_src

#+RESULTS:
: qz/org-roam-add-global-prop

*** add roam_tag, preserving existing :func:
#+begin_src emacs-lisp
(defun qz/org-roam-add-tag (tag &optional filetag_too)
  (qz/org-roam-add-global-prop "roam_tags" tag)
  (when filetag_too
    (qz/org-roam-add-global-prop "filetags" tag)))
#+end_src

#+RESULTS:
: qz/org-roam-add-tag

*** TODO auto establish meta :func:
*** TODO auto tag youtube videos
#+begin_src emacs-lisp
(defun qz/format-link-from-title (title)
  (let ((file (org-roam-link--get-file-from-title title)))
    (and file (org-roam-format-link file title))))

(defun qz/roam-auto-youtube-video ()
  (interactive)
  (let ((key (+org--get-property "roam_key")))
    (when (string-match "YouTube" key)
      (let*
        ((channel+url (qz/roam-key->yt-channel key))
         (link (qz/format-link-from-title (first channel+url)))
         (channel (or link (concat "[[roam:" (first channel+url) "]]")))
         (str
          (concat "A "
                  (qz/format-link-from-title "YouTube") " "
                  (qz/format-link-from-title "video") " from "
                  channel)))
        (insert str)))))
#+end_src

#+RESULTS:
: qz/roam-auto-youtube-video


*** TODO scrape youtube channel

#+begin_src emacs-lisp
(defun qz/roam-key->yt-channel (key)
  (let ((str (shell-command-to-string
              (concat
               "youtube-dl " key "--skip-download --dump-json | "
               "python -c 'import sys;import json;b=json.loads(sys.stdin.read());print(b.get(\"channel\")+\",\"+b.get(\"channel_url\"))'"))))
    (message str)
    (and str (split-string str ","))))

;(qz/roam-key->yt-channel "https://www.youtube.com/watch?v=KopB4l5QkEg")
#+end_src

#+RESULTS:
| HexiBase | https://www.youtube.com/channel/UCtpB66XKjAtFZfZyzmC-_Cg |


**** what a journey
#+begin_src bash :results raw drawer :tangle no
youtube-dl --skip-download --dump-json https://www.youtube.com/watch?v=KopB4l5QkEg | python -c 'import json;import sys;print(json.loads(sys.stdin.read()).get("channel"))'
#+end_src

#+RESULTS:
:results:
HexiBase
:end:


#+begin_src python  :results output :tangle no
import json
c = None
with open('./ytdl.json') as f:
    c = json.loads(f.read())

print(c.get('channel'))
#+end_src

#+RESULTS:
: HexiBase


*** TODO Run analysis :func:
Run analysis from source file on org-roam DB
- restrict graph (e.g. exclude sensitive information)
*** headline parsing function
#+begin_src emacs-lisp
(defun qz/get-headline-path (&optional self? reverse? sepf)
  (interactive)
  (let* ((s (or sepf
                (lambda (i)
                  (if (< 0 i) " -> " ""))))
         (c (org-get-outline-path self?)))
    (insert "\n")
    (cl-loop
     for e in (if reverse? (reverse c) c)
     for i = 0 then (1+ i)
     do (insert (funcall s i) e))))

(defun qz/headline-mm (i)
  (if (< 0 i)
      (concat "\n" (make-string i ?	)) ""))

;; example, for https://tobloef.com/text2mindmap/ + [[file:../../../life/roam/20210521T102710Z-the_great_ideas_vol_ii.org][The Great Ideas, Vol II]]
;;(qz/get-headline-path t t 'qz/headline-mm)


;; (progn
;;   (qz/get-headline-path)
;;   (qz/get-headline-path nil t)
;;   (qz/get-headline-path t)
;;   (qz/get-headline-path t t)
;;   (qz/get-headline-path t t 'qz/headline-mm)
;;   (qz/get-headline-path t nil 'qz/headline-mm)
;;   (qz/get-headline-path nil nil 'qz/headline-mm))
#+end_src

#+RESULTS:
: qz/headline-mm
*** TODO transform an org subtree, into mindmap for ttmm :ttmm:
tab delimit
given a subtree (at point)

*** TODO query slice of headlines, containing REGEXP, build path with [[headline parsing function]]

*** org-roam-server :init:vars:
[[https://github.com/org-roam/org-roam-server][GitHub - org-roam/org-roam-server]]
#+begin_src emacs-lisp
(use-package! org-roam-server
  :config
  (setq org-roam-server-host "127.0.0.1"
        org-roam-server-port 8080
        org-roam-server-export-inline-images t
        org-roam-server-authenticate nil
        org-roam-server-network-label-truncate t
        org-roam-server-network-label-truncate-length 60))
#+end_src

#+RESULTS:
: t

** org-noter
