config.el

(defun qz/has-link-to (src dst)
  (org-roam-db-query
   [:select source
    :from links
    :where (and (= dest $r1)
                (= source $r2))]
   src dest))

(defun qz/has-link (a b)
  (seq-map
   #'car
   (org-roam-db-query
    [:select [source dest]
     :from links
     :where (or (and (= dest a) (= source b))
                (and (= dest b) (= source a)))])))

                                        ;(org-roam-db-query
                                        ; [:select *
                                        ;  :from links
                                        ;  :where (and (= dest $r1)
                                        ;              (= source $r2))]
                                        ; "/home/qzdl/life/roam/20200401201707-thinkproject.org"
                                        ; "/home/qzdl/life/roam/20210311T113202Z-chris_heimann.org")
                                        ;
                                        ;(qz/has-link-to
                                        ; "/home/qzdl/life/roam/20210311T113202Z-chris_heimann.org"
                                        ; "/home/qzdl/life/roam/20200401201707-thinkproject.org"))

(org-roam-db-query
    [:select *
     :from links
     :limit 10])

(defun qz/org-roam-make-private ()
  (interactive)
  (qz/org-roam-add-tag "private" t))

(defun qz/org-roam-has-link-to-p (source dest)
  """TODO implement; returns t/nil if source links to dest"
  nil)

(defun qz/org-roam-add-global-prop (prop val)
  (org-roam--set-global-prop
   prop
   (combine-and-quote-strings
    (seq-uniq
     (cons val (split-string-and-unquote
                (or (+org--get-property prop) "")))))))

(defun qz/org-roam-add-tag (tag &optional filetag_too)
  (qz/org-roam-add-global-prop "roam_tags" tag)
  (when filetag_too
    (qz/org-roam-add-global-prop "filetags" tag)))

(defun qz/get-headline-path (&optional self? reverse? sepf)
  (interactive)
  (let* ((s (or sepf
                (lambda (i)
                  (if (< 0 i) " -> " ""))))
         (c (org-get-outline-path self?)))
    (insert "\n")
    (cl-loop
     for e in (if reverse? (reverse c) c)
     for i = 0 then (1+ i)
     do (insert (funcall s i) e))))

(defun qz/headline-mm (i)
  (if (< 0 i)
      (concat "\n" (make-string i ?	)) ""))

;; example, for https://tobloef.com/text2mindmap/ + [[file:../../../life/roam/20210521T102710Z-the_great_ideas_vol_ii.org][The Great Ideas, Vol II]]
;;(qz/get-headline-path t t 'qz/headline-mm)


;; (progn
;;   (qz/get-headline-path)
;;   (qz/get-headline-path nil t)
;;   (qz/get-headline-path t)
;;   (qz/get-headline-path t t)
;;   (qz/get-headline-path t t 'qz/headline-mm)
;;   (qz/get-headline-path t nil 'qz/headline-mm)
;;   (qz/get-headline-path nil nil 'qz/headline-mm))

(use-package! org-roam-server
  :config
  (setq org-roam-server-host "127.0.0.1"
        org-roam-server-port 8080
        org-roam-server-export-inline-images t
        org-roam-server-authenticate nil
        org-roam-server-network-label-truncate t
        org-roam-server-network-label-truncate-length 60))

(require 'org-ref)
