config.org
*** agenda view, gtd :func:vars:
#+begin_src emacs-lisp
(defun qz/org-agenda-gtd ()
  (interactive)
  (org-agenda nil "g")
  (org-agenda-goto-today))

(setq org-agenda-custom-commands nil)
(add-to-list
 'org-agenda-custom-commands
 `("g" "GTD"
   ((agenda "" ((org-agenda-span 'day) (org-deadline-warning-days 60)))
    (tags-todo "wip"
               ((org-agenda-overriding-header "wip")))
    (todo "TODO"
          ((org-agenda-overriding-header "To Refile")
           (org-agenda-files '(,(concat qz/org-agenda-directory "inbox.org")))))
    (todo "TODO"
          ((org-agenda-overriding-header "Emails")
           (org-agenda-files '(,(concat qz/org-agenda-directory "emails.org")))))
    (todo "TODO"
          ((org-agenda-overriding-header "One-off Tasks")
           (org-agenda-files '(,(concat qz/org-agenda-directory "next.org"))))))))
    ;;        (org-agenda-skip-function '(org-agenda-skip-entry-if 'deadline 'scheduled))))

(qz/pprint org-agenda-custom-commands)
#+end_src
*** safer org defer whaever

#+begin_src emacs-lisp
 (defun +org-defer-mode-in-agenda-buffers-h ()
      "`org-agenda' opens temporary, incomplete org-mode buffers.
I've disabled a lot of org-mode's startup processes for these invisible buffers
to speed them up (in `+org--exclude-agenda-buffers-from-recentf-a'). However, if
the user tries to visit one of these buffers they'll see a gimped, half-broken
org buffer. To avoid that, restart `org-mode' when they're switched to so they
can grow up to be fully-fledged org-mode buffers."
      (dolist (buffer org-agenda-new-buffers)
        (when (buffer-live-p buffer)
          (with-current-buffer buffer
            (add-hook 'doom-switch-buffer-hook #'+org--restart-mode-h
                      nil 'local)))))
#+end_src

#+RESULTS:
: +org-defer-mode-in-agenda-buffers-h

*** agenda view, shopping :func:vars:
#+begin_src emacs-lisp
(add-to-list
 'org-agenda-custom-commands
 '("ms" "shopping" tags "buy"))
#+end_src
#+RESULTS:
| ms | shopping           | tags                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              | buy         |                                                                                                    |          |              |
| g  | GTD                | ((agenda  ((org-agenda-span 'day) (org-deadline-warning-days 60))) (tags-todo wip ((org-agenda-overriding-header wip))) (todo TODO ((org-agenda-overriding-header To Refile) (org-agenda-files '(~/life/roam/inbox.org)))) (todo TODO ((org-agenda-overriding-header Emails) (org-agenda-files '(~/life/roam/emails.org)))) (todo NEXT ((org-agenda-overriding-header Silo) (org-agenda-files '(~/life/roam/someday.org ~/life/roam/projects.org ~/life/roam/next.org)))) (todo TODO ((org-agenda-overriding-header Projects) (org-agenda-files '(~/life/roam/projects.org)))) (todo TODO ((org-agenda-overriding-header One-off Tasks) (org-agenda-files '(~/life/roam/next.org)) (org-agenda-skip-function '(org-agenda-skip-entry-if 'deadline 'scheduled))))) |             |                                                                                                    |          |              |
| d  | Upcoming deadlines | agenda                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |             | ((org-agenda-time-grid nil) (org-deadline-warning-days 365) (org-agenda-entry-types '(:deadline))) |          |              |
| ww | wip all            | tags                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              | wip         |                                                                                                    |          |              |
| wr | wip reading        | tags                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              | wip+reading |                                                                                                    | wip+read | reading+next |
| hh | tags               | +habit                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                            |             |                                                                                                    |          |              |
| P  | Printed agenda     | ((agenda  ((org-agenda-span 7) (org-agenda-start-on-weekday nil) (org-agenda-repeating-timestamp-show-all t) (org-agenda-entry-types '(:timestamp :sexp)))) (agenda  ((org-agenda-span 1) (org-deadline-warning-days 7) (org-agenda-todo-keyword-format [ ]) (org-agenda-scheduled-leaders '( )) (org-agenda-prefix-format %t%s))) (todo TODO ((org-agenda-prefix-format [ ] %T: ) (org-agenda-sorting-strategy '(tag-up priority-down)) (org-agenda-todo-keyword-format ) (org-agenda-overriding-header                                                                                                                                                                                                                                                          |             |                                                                                                    |          |              |

*** agenda view, TODO :func:
#+begin_src emacs-lisp
(defun qz/org-agenda-todo ()
  (interactive)
  (org-agenda nil "t"))
#+end_src

*** TODO agenda view, wip
#+begin_src emacs-lisp 
#+end_src

*** TODO agenda view, calendar

*** map :kbd:
#+begin_src emacs-lisp
(map! :map org-agenda-mode-map
      "J" #'qz/org-agenda-process-inbox
      "C-j" #'qz/org-agenda-process-item
      "R" #'org-agenda-refile)
#+end_src

#+RESULTS:

*** process agenda item :func:
- Give the task some location context. Tagging the task with tags @work and
  @home means I can work on this appropriately
- Give the task a priority level, between A, B, and C. Here’s how I decide a
  priority. It’s a pretty loose dichotomy, but works for me.
  - A: Tasks that must get done regardless.
  - B: Tasks that should get done, but only after Priority A tasks.
  - C: Tasks that are good to get done, but not compulsory.
- Give the task an effort estimate. This is in the format HH:MM, if the task is
  estimated to take days, perhaps it needs to be broken down further.
- Refile the item. Here my tasks get assigned to a selection from relevant
  refile targets.
#+begin_src emacs-lisp

(setq org-agenda-bulk-custom-functions '((?b . #'qz/org-agenda-process-item)))

(defun qz/org-process-inbox ()
  "Called in org-agenda-mode, processes all inbox items."
  (interactive)
  (org-agenda-bulk-mark-regexp "inbox:")
  (org-agenda-bulk-action ?b))


(defun qz/org-agenda-process-item ()
  "Process a single item in the org-agenda."
  (interactive)
  (org-with-wide-buffer
   (org-agenda-set-tags)
   (org-agenda-priority)
   (org-agenda-refile nil nil t)))
#+end_src

#+RESULTS:
: qz/org-agenda-process-item


*** TODO processing bulk agenda :func:
#+begin_src emacs-lisp

#+end_src

#+RESULTS:
: qz/org-process-inbox


*** tags
#+begin_src emacs-lisp
(setq org-tag-alist
      '(("@errand" . ?e)
        ("@work" . ?w)
        ("@home" . ?h)
        ("@blog" . ?B)
        (:newline)
        ("emacs" . ?E)
        ("wip" . ?W)
        ("CANCELLED" . ?c)
        (:newline)
        ("learning" . ?l)
        ("research" . ?r)
        (:newline)
        (:newline)
        ("book" . ?b)
        ("article" . ?a)
        ("paper" . ?p)
        (:newline)
        (:newline)
        ("talk" . ?t)
        ("film" . ?f)))
#+end_src

#+RESULTS:
: ((@errand . 101) (@work . 119) (@home . 104) (@blog . 66) (:newline) (emacs . 69) (wip . 87) (CANCELLED . 99) (:newline) (learning . 108) (research . 114) (:newline) (:newline) (book . 98) (article . 97) (paper . 112) (:newline) (:newline) (talk . 116) (film . 102))
** org-super-agenda
#+begin_src emacs-lisp
(require 'org-super-agenda)

#+end_src

** TODO [[file:../../../life/roam/20200722T143300Z-org_drill.org][org-drill]]
** ox (export)
#+begin_src emacs-lisp
(require 'ox-reveal)
#+end_src

#+RESULTS:
: ox-reveal
* mathpix
#+begin_src emacs-lisp
(require 'mathpix)
(setq mathpix-screenshot-method "scrot -s %s")

(map! "C-c o m" #'qz/mathpix-screenshot)
;; add var capture
(defun qz/mathpix-screenshot ()
  "Capture screenshot and send result to Mathpix API."
  (interactive)
  (let
      ((default-directory "~"))
    (make-directory
     (file-name-directory mathpix-screenshot-file)
     t)
    (if
        (functionp mathpix-screenshot-method)
        (funcall mathpix-screenshot-method mathpix-screenshot-file)
      (shell-command-to-string
       (format mathpix-screenshot-method mathpix-screenshot-file)))
    (if
        (file-exists-p mathpix-screenshot-file)
        (progn
          (insert
           (setq mathpix-last-result
                 (mathpix-get-result mathpix-screenshot-file)))
          (delete-file mathpix-screenshot-file)))))
#+end_src

#+RESULTS:
: qz/mathpix-screenshot

* TODO GNUs
Following [[https://www.emacswiki.org/emacs/GnusTutorial][EmacsWiki: Gnus Tutorial]]

* TODO Completion
** orderless
ideally the ordering should account ~match, last-used, degree~
